notes/2.5-automatic-differentiation.org
#+PROPERTY: header-args    :tangle src/clj_d2l/auto_diff.clj
* Automatic Differentiation

As we have explained in Section 2.4, differentiation is a crucial step
in nearly all deep learning optimization algorithms. While the
calculations for taking these derivatives are straightforward,
requiring only some basic calculus, for complex models, working out
the updates by hand can be a pain (and often error-prone).

Deep learning frameworks expedite this work by automatically
calculating derivatives, i.e., *automatic differentiation*. In practice,
based on our designed model the system builds a *computational graph*,
tracking which data combined through which operations to produce the
output. Automatic differentiation enables the system to subsequently
backpropagate gradients. Here, *backpropagate* simply means to trace
through the computational graph, filling in the partial derivatives
with respect to each parameter.

#+begin_src clojure :results silent :exports both
(ns clj-d2l.auto-diff
  (:require [clj-djl.ndarray :as nd]
            [clj-djl.training :as t]))
#+end_src


** A Simple Example


As a toy example, say that we are interested in differentiating the
function \(y = 2\mathbf{x}^{\top}\mathbf{x}\) with respect to the
column vector \(\mathbf{x}\). To start, let us create the variable
\(x\) and assign it an initial value.

#+begin_src clojure :results pp :exports both :eval no-export
(def ndm (nd/base-manager))
(def x (nd/arange ndm 4.))
x
#+end_src

#+RESULTS:
: ND: (4) cpu() float32
: [0., 1., 2., 3.]

Before we even calculate the gradient of \(y\) with respect to
\(\mathbf{x}\), we will need a place to store it. It is important that
we do not allocate new memory every time we take a derivative with
respect to a parameter because we will often update the same
parameters thousands or millions of times and could quickly run out of
memory. Note that a gradient of a scalar-valued function with respect
to a vector \(\mathbf{x}\) is itself vector-valued and has the same
shape as \(\mathbf{x}\).

#+begin_src clojure :results pp :exports both :eval no-export
(t/set-requires-gradient x true)
(t/get-gradient x)
#+end_src

#+RESULTS:
: ND: (4) cpu() float32
: [0., 0., 0., 0.]

We place our code inside a ~with-open~ and declare the
~gradient-collector~ object that will build the computational graph. Now
let us calculate \(y\).

Since \(\mathbf{x}\) is a vector of length 4, an inner product of
\(\mathbf{x}\) and \(\mathbf{x}\) is performed, yielding the scalar
output that we assign to \(\mathbf{y}\). Next, we can automatically
calculate the gradient of \(\mathbf{y}\) with respect to each component
of \(\mathbf{x}\) by calling the function for backpropagation and
printing the gradient.

#+begin_src clojure :results output :exports both :eval no-export
(with-open [gc (t/gradient-collector)]
  (let [y (nd/* (nd/dot x x) 2)]
    (print (str y))
    (t/backward gc y)))
#+end_src

#+RESULTS:
: ND: () cpu() float32
: 28.

#+begin_src clojure :results pp :exports both :eval no-export
(t/get-gradient x)
#+end_src

#+RESULTS:
: ND: (4) cpu() float32
: [ 0.,  4.,  8., 12.]


The gradient of the function \(y = 2\mathbf{x}^{\top}\mathbf{x}\) with
respect to \(\mathbf{x}\) should be \(4\mathbf{x}\). Let us quickly
verify that our desired gradient was calculated correctly.

#+begin_src clojure :results value pp :exports both
(nd/= (t/get-gradient x) (nd/* x 4))
#+end_src

#+RESULTS:
: ND: (4) cpu() boolean
: [ true,  true,  true,  true]

Now let us calculate another function of \(\mathbf{x}\).

#+begin_src clojure :results pp :exports both :eval no-export
(with-open [gc (t/gradient-collector)]
  (let [y (nd/sum x)]
    (t/backward gc y)))

(t/get-gradient x)
#+end_src

#+RESULTS:
: ND: (4) cpu() float32
: [1., 1., 1., 1.]


