notes/2.5-automatic-differentiation.org
** Backward for Non-Scalar Variables

Technically, when \(y\) is not a scalar, the most natural
interpretation of the differentiation of a vector \(\mathbf{y}\) with
respect to a vector \(\mathbf{x}\) is a matrix. For higher-order and
higher-dimensional \(\mathbf{y}\) and \(\mathbf{x}\), the
differentiation result could be a high-order tensor.

However, while these more exotic objects do show up in advanced
machine learning (including in deep learning), more often when we are
calling backward on a vector, we are trying to calculate the
derivatives of the loss functions for each constituent of a *batch* of
training examples.  Here, our intent is not to calculate the
differentiation matrix but rather the sum of the partial derivatives
computed individually for each example in the batch.

#+begin_src clojure :results pp :exports both :eval no-export
(with-open [gc (t/gradient-collector)]
  (let [y (nd/* x x)]
    (t/backward gc y)))
(t/get-gradient x)
#+end_src

#+RESULTS:
: ND: (4) cpu() float32
: [0., 2., 4., 6.]


** Detaching Computation

Sometimes, we wish to move some calculations outside of the recorded
computational graph. For example, say that \(\mathbf{y}\) was
calculated as a function of \(\mathbf{x}\), and that subsequently
\(\mathbf{z}\) was calculated as a function of both \(\mathbf{y}\) and
\(\mathbf{x}\). Now, imagine that we wanted to calculate the gradient
of \(\mathbf{z}\) with respect to \(\mathbf{x}\), but wanted for some
reason to treat \(\mathbf{y}\) as a constant, and only take into
account the role that \(\mathbf{x}\) played after \(\mathbf{y}\) was
calculated.

Here, we can detach \(\mathbf{y}\) using ~stop-gradient~ to return a new
variable \(\mathbf{u}\) that has the same value as \(\mathbf{y}\) but
discards any information about how \(\mathbf{y}\) was computed in the
computational graph. In other words, the gradient will not flow
backwards through \(\mathbf{u}\) to \(\mathbf{x}\). Thus, the
following backpropagation function computes the partial derivative of
\(\mathbf{z} = \mathbf{u} \times \mathbf{x}\) with respect to
\(\mathbf{x}\) while treating \(\mathbf{u}\) as a constant, instead of
the partial derivative of \(\mathbf{z} = \mathbf{x} \times \mathbf{x}
\times \mathbf{x}\) with respect to \(\mathbf{x}\).

#+begin_src clojure :results pp :exports both :eval no-export
(with-open [gc (t/gradient-collector)]
  (let [y (nd/* x x)
        u (t/stop-gradient y)
        z (nd/* u x)]
    (t/backward gc z)
    (nd/= u (t/get-gradient x))))
#+end_src

#+RESULTS:
: ND: (4) cpu() boolean
: [ true,  true,  true,  true]

We can subsequently invoke backpropagation on \(\mathbf{y}\) to get
the derivative of \(\mathbf{y} = \mathbf{x} \times \mathbf{x}\) with
respect to \(\mathbf{x}\), which is \(2 \times \mathbf{x}\).

#+begin_src clojure :results pp :exports both :eval no-export
(with-open [gc (t/gradient-collector)]
  (let [y (nd/* x x)
        y (nd/* x x)]
    (t/backward gc y)
    (nd/= (t/get-gradient x) (nd/* x 2))))
#+end_src

#+RESULTS:
: ND: (4) cpu() boolean
: [ true,  true,  true,  true]
#+end_src

