notes/2.5-automatic-differentiation.org
** Computing the Gradient of Clojure Control Flow

One benefit of using automatic differentiation is that even if
building the computational graph of a function required passing
through a maze of Clojure control flow (e.g., conditionals, loops, and
arbitrary function calls), we can still calculate the gradient of the
resulting variable.  In the following snippet, note that the number of
iterations of the ~loop~ and the evaluation of the ~if~ statement both
depend on the value of the input \(\mathbf{a}\).

#+begin_src clojure :results silent :exports both
(defn f [a]
  (loop [b (nd/* a 2)]
    (if (nd/get-element (.lt (nd/norm b) 1000))
      (recur (nd/* b 2))
      (if (nd/get-element (.gt (nd/sum b) 0))
        b
        (nd/* b 100)))))
#+end_src

Let us compute the gradient.

We can then analyze the ~f~ function defined above. Note that it is
piecewise linear in its input \(\mathbf{a}\). In other words, for any
\(\mathbf{a}\) there exists some constant scalar \(k\) such that
\(f(\mathbf{a}) = k \times \mathbf{a}\), where the value of \(k\)
depends on the input \(\mathbf{a}\). Consequently ~(nd// d a)~ allows us
to verify that the gradient is correct.

#+begin_src clojure :results pp :exports both :eval no-export
(def a (nd/random-normal ndm [10]))
a
#+end_src

#+RESULTS:
: ND: (10) cpu() float32
: [-1.423 , -0.1475,  0.5799,  0.4026, -0.9635,  1.2715, -1.4396, -1.0244,  0.4675, -0.3938]

#+begin_src clojure :results pp :exports both :eval no-export
(t/set-requires-gradient a true)
(with-open [gc (t/gradient-collector)]
  (let [d (f a)]
    (t/backward gc d)
    (println (str (nd// d a)))
    (println (str (nd/= (t/get-gradient a) (nd// d a))))))
#+end_src

#+RESULTS:
: ND: (10) cpu() float32
: [51200., 51200., 51200., 51200., 51200., 51200., 51200., 51200., 51200., 51200.]
:
: ND: (10) cpu() boolean
: [ true,  true,  true,  true,  true,  true,  true,  true,  true,  true]
:

** Summary

- Deep learning frameworks can automate the calculation of
  derivatives.  To use it, we first attach gradients to those
  variables with respect to which we desire partial derivatives. We
  then record the computation of our target value, execute its
  function for backpropagation, and access the resulting gradient.
